bench.log
Bombarding http://localhost:8080/index.html for 30s using 400 connection(s)



 00m35s
 00m35s
 00m35s
[...]
 00m28s
 00m28s
 00m28s
[...]
 00m27s
 00m27s
 00m27s
[...]
 00m26s
 00m26s
 00m26s
[...]
 00m25s
 00m25s
 00m25s
[...]
 00m24s
 00m24s
 00m24s
 00m23s
 00m23s
 00m23s
[...]
 00m22s
 00m22s
 00m22s
[...]
 00m21s
 00m21s
 00m21s
[...]
 00m20s
 00m20s
 00m20s
[...]
 00m19s
 00m19s
 00m18s
 00m18s
 00m18s
[...]
 00m17s
 00m17s
 00m17s
[...]
 00m16s
 00m16s
 00m16s
[...]
 00m15s
 00m15s
 00m15s
[...]
 00m14s
 00m14s
 00m14s
[...]
 00m13s
 00m13s
 00m13s
[...]
 00m12s
 00m12s
 00m12s
[...]
 00m11s
 00m11s
 00m11s
[...]
 00m10s
 00m10s
 00m10s
[...]
 00m09s
 00m09s
 00m09s
[...]
 00m08s
 00m08s
 00m08s
[...]
 00m07s
 00m07s
 00m07s
[...]
 00m06s
 00m06s
 00m06s
[...]
 00m05s
 00m05s
 00m05s
[...]
 00m04s
 00m04s
 00m04s
[...]
 00m03s
 00m03s
 00m03s
[...]
 00m02s
 00m02s
 00m02s
[...]
 00m01s
 00m01s
 00m01s
[...]



 30s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       409.86     336.91    2385.30
  Latency         1.10s      0.91s      6.23s
  HTTP codes:
    1xx - 0, 2xx - 10650, 3xx - 0, 4xx - 0, 5xx - 0
    others - 378
  Errors:
    dial tcp [::1]:8080: connectex: Nenhuma conex├úo p├┤de ser feita porque a m├íquina de destino as recusou ativamente. - 378
  Throughput:    72.36KB/s